; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v2 - type_1 ?v3 - type_2)
 	      (pred_2 ?v6 - object ?v3 - type_2)
	      (pred_1 ?v2 - type_1 ?v7 - type_3)
	      (pred_3 ?v2 - type_1 ?v6 - object ?v7 - type_3))

   (:action op_3
       :parameters  (?v2 - type_1 ?v5 ?v1 - type_2)
       :precondition (and  (pred_4 ?v2 ?v5))
       :effect (and  (pred_4 ?v2 ?v1)
		     (not (pred_4 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_1 ?v8 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v4) (pred_4 ?v2 ?v4) (pred_1 ?v2 ?v7))
       :effect (and (pred_3 ?v2 ?v8 ?v7)
		    (not (pred_2 ?v8 ?v4)) 
		    (not (pred_1 ?v2 ?v7))))

   (:action op_2
       :parameters (?v2 - type_1 ?v8 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v8 ?v7) (pred_4 ?v2 ?v4))
       :effect (and (pred_2 ?v8 ?v4)
		    (pred_1 ?v2 ?v7)
		    (not (pred_3 ?v2 ?v8 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_12 - type_1
obj_05 obj_04 obj_09 obj_02 - type_3
obj_07 obj_01 obj_08 obj_06 - type_2
obj_10 obj_13 obj_03 - object)
(:init
(pred_4 obj_11 obj_08)
(pred_1 obj_11 obj_05)
(pred_1 obj_11 obj_04)
(pred_4 obj_12 obj_06)
(pred_1 obj_12 obj_09)
(pred_1 obj_12 obj_02)
(pred_2 obj_10 obj_07)
(pred_2 obj_13 obj_06)
(pred_2 obj_03 obj_01)
)
(:goal
(and
(pred_2 obj_10 obj_06)
(pred_2 obj_13 obj_06)
(pred_2 obj_03 obj_06)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_06)))
)
)

; plan
1. (op_3 obj_11 obj_08 obj_07)
   deleted: (pred_4 obj_11 obj_08)
   added: (pred_4 obj_11 obj_07)
   goals met: 1 of 3
2. (op_3 obj_12 obj_06 obj_01)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_01)
   goals met: 1 of 3
3. (op_1 obj_11 obj_10 obj_07 obj_04)
   deleted: (pred_2 obj_10 obj_07) (pred_1 obj_11 obj_04)
   added: (pred_3 obj_11 obj_10 obj_04)
   goals met: 1 of 3
4. (op_1 obj_12 obj_03 obj_01 obj_02)
   deleted: (pred_2 obj_03 obj_01) (pred_1 obj_12 obj_02)
   added: (pred_3 obj_12 obj_03 obj_02)
   goals met: 1 of 3
5. (op_3 obj_12 obj_01 obj_06)
   deleted: (pred_4 obj_12 obj_01)
   added: (pred_4 obj_12 obj_06)
   goals met: 1 of 3
6. (op_2 obj_11 obj_10 obj_07 obj_04)
   deleted: (pred_3 obj_11 obj_10 obj_04)
   added: (pred_2 obj_10 obj_07) (pred_1 obj_11 obj_04)
   goals met: 1 of 3
7. (op_2 obj_12 obj_03 obj_06 obj_02)
   deleted: (pred_3 obj_12 obj_03 obj_02)
   added: (pred_2 obj_03 obj_06) (pred_1 obj_12 obj_02)
   goals met: 2 of 3
8. (op_3 obj_12 obj_06 obj_07)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_07)
   goals met: 2 of 3
9. (op_1 obj_12 obj_10 obj_07 obj_02)
   deleted: (pred_2 obj_10 obj_07) (pred_1 obj_12 obj_02)
   added: (pred_3 obj_12 obj_10 obj_02)
   goals met: 2 of 3
10. (op_3 obj_12 obj_07 obj_06)
   deleted: (pred_4 obj_12 obj_07)
   added: (pred_4 obj_12 obj_06)
   goals met: 2 of 3
11. (op_2 obj_12 obj_10 obj_06 obj_02)
   deleted: (pred_3 obj_12 obj_10 obj_02)
   added: (pred_2 obj_10 obj_06) (pred_1 obj_12 obj_02)
   goals met: 3 of 3
